#coding utf-8
#Задача №1
x = int(input("значение переменной x=")) 
y = 7 * x + 5
print ("значение функции y=", y)

#Задача №2
q = int(input("введите значение переменной q=")) 
w = 4 * q
print ("значение переменной w=",w)

#Задача №3
e = int(input("значение переменной e="))
r = 2*3.14*e 
print ("значение переменной r=",r)

#Задача №4
u = int(input("Введите диаметр окружности:u= "))
i = u / 2
s = 3.14 * i**2
print("Площадь окружности: s=",s)

#Задача №5
a = int(input("Введите длину первого катета a="))
b = int(input("Введите длину второго катета b= "))
c = sqrt(a**2 + b**2)

print("Длина гипотенузы:",c)


